## Indexing and Selecting Data

### .loc
- lable 기반
- label의 목록이나 배열
- label의 슬라이스 객체( ex))'a' : 'f' )
- boolean 배열, 이때 NA 값은 모두 False처리된다.

### .iloc
- 정수 위치 기반 ( 0 ~ length -1 )
- 정수
- 정수 list (ex : [4 ,6 ,7])
- boolean 배열, 이때 NA 값은 모두 False처리된다.

In [6]:
import pandas as pd
import numpy as np

### Basic

In [19]:
dates = pd.date_range('1/1/2000', periods = 8)
dates

DatetimeIndex(['2000-01-01', '2000-01-02', '2000-01-03', '2000-01-04',
               '2000-01-05', '2000-01-06', '2000-01-07', '2000-01-08'],
              dtype='datetime64[ns]', freq='D')

In [49]:
df =pd.DataFrame(np.random.randn(8, 4), index = dates, columns = ['A', 'B', 'C', 'D'])
df

                   A         B         C         D
2000-01-01  0.845624 -0.573511  0.981086  1.535190
2000-01-02  0.214991 -0.059478  1.467596  0.641940
2000-01-03 -0.982135  0.907686 -1.160281  0.601779
2000-01-04 -1.886670  0.398935  1.254168  0.012873
2000-01-05 -1.497248  0.023301  0.734020  0.757533
2000-01-06 -0.511338 -0.478900  0.724252  1.374516
2000-01-07  0.320570  0.969433  0.597147  1.785227
2000-01-08  0.391406 -1.122850 -0.437759  0.199615

In [21]:
s = df['A']
s

2000-01-01    0.364024
2000-01-02   -0.667282
2000-01-03   -0.150349
2000-01-04    0.201652
2000-01-05   -1.297984
2000-01-06    1.549224
2000-01-07   -0.410140
2000-01-08    2.216367
Freq: D, Name: A, dtype: float64

In [22]:
s[dates[5]]

1.5492241649593603

In [23]:
df

                   A         B         C         D
2000-01-01  0.364024  0.624100 -0.026896 -2.331443
2000-01-02 -0.667282  0.512888  0.442193  0.483017
2000-01-03 -0.150349  0.912235  0.192828  0.367435
2000-01-04  0.201652  0.201392  0.311533 -0.418815
2000-01-05 -1.297984 -0.446932 -0.115283 -1.678346
2000-01-06  1.549224  1.544983  0.384588 -0.728785
2000-01-07 -0.410140  0.110446  0.439832  1.631692
2000-01-08  2.216367 -0.218470 -0.216192  1.190439

In [13]:
df[['B', 'A']] = df[['A', 'B']]
df

                   A         B         C         D
2000-01-01  0.588893  0.089725  1.170750 -1.195438
2000-01-02 -0.534885 -0.974249 -1.058160  0.603326
2000-01-03 -0.275824 -0.589778 -0.851069  0.519266
2000-01-04 -2.546031 -0.291630 -1.919783  1.633556
2000-01-05  1.470275 -0.310744  1.548437  0.584582
2000-01-06 -0.193790  1.013714 -0.546474 -0.882976
2000-01-07  0.058826 -0.779116  2.636786  0.157272
2000-01-08 -0.667834  0.360976  0.899627  0.013670

.loc와 .iloc에서 Series와 DataFrame를 setting 할 때 pandas는 모든 축을 정렬한다.<br>이것은 df에 값을 직접 할당하기 전에 df 자체를 수정하진 않는다.

In [24]:
df[['A', 'B']]

                   A         B
2000-01-01  0.364024  0.624100
2000-01-02 -0.667282  0.512888
2000-01-03 -0.150349  0.912235
2000-01-04  0.201652  0.201392
2000-01-05 -1.297984 -0.446932
2000-01-06  1.549224  1.544983
2000-01-07 -0.410140  0.110446
2000-01-08  2.216367 -0.218470

In [25]:
df.loc[:, ['B', 'A']] = df[['A', 'B']]

In [26]:
df[['A', 'B']]

                   A         B
2000-01-01  0.364024  0.624100
2000-01-02 -0.667282  0.512888
2000-01-03 -0.150349  0.912235
2000-01-04  0.201652  0.201392
2000-01-05 -1.297984 -0.446932
2000-01-06  1.549224  1.544983
2000-01-07 -0.410140  0.110446
2000-01-08  2.216367 -0.218470

### Attribute access

In [27]:
sa = pd.Series([1,2,3], index=list('abc'))
sa

a    1
b    2
c    3
dtype: int64

In [30]:
dfa = df.copy()
dfa

                   A         B         C         D
2000-01-01  0.364024  0.624100 -0.026896 -2.331443
2000-01-02 -0.667282  0.512888  0.442193  0.483017
2000-01-03 -0.150349  0.912235  0.192828  0.367435
2000-01-04  0.201652  0.201392  0.311533 -0.418815
2000-01-05 -1.297984 -0.446932 -0.115283 -1.678346
2000-01-06  1.549224  1.544983  0.384588 -0.728785
2000-01-07 -0.410140  0.110446  0.439832  1.631692
2000-01-08  2.216367 -0.218470 -0.216192  1.190439

In [31]:
sa.b

2

In [32]:
dfa.A

2000-01-01    0.364024
2000-01-02   -0.667282
2000-01-03   -0.150349
2000-01-04    0.201652
2000-01-05   -1.297984
2000-01-06    1.549224
2000-01-07   -0.410140
2000-01-08    2.216367
Freq: D, Name: A, dtype: float64

In [34]:
sa.a = 5

In [35]:
sa

a    5
b    2
c    3
dtype: int64

In [36]:
dfa.A = list(range(len(dfa.index)))
dfa

            A         B         C         D
2000-01-01  0  0.624100 -0.026896 -2.331443
2000-01-02  1  0.512888  0.442193  0.483017
2000-01-03  2  0.912235  0.192828  0.367435
2000-01-04  3  0.201392  0.311533 -0.418815
2000-01-05  4 -0.446932 -0.115283 -1.678346
2000-01-06  5  1.544983  0.384588 -0.728785
2000-01-07  6  0.110446  0.439832  1.631692
2000-01-08  7 -0.218470 -0.216192  1.190439

In [38]:
dfa['A'] = list(range(len(dfa.index)))
dfa

            A         B         C         D
2000-01-01  0  0.624100 -0.026896 -2.331443
2000-01-02  1  0.512888  0.442193  0.483017
2000-01-03  2  0.912235  0.192828  0.367435
2000-01-04  3  0.201392  0.311533 -0.418815
2000-01-05  4 -0.446932 -0.115283 -1.678346
2000-01-06  5  1.544983  0.384588 -0.728785
2000-01-07  6  0.110446  0.439832  1.631692
2000-01-08  7 -0.218470 -0.216192  1.190439

In [39]:
x = pd.DataFrame({'x' : [1,2,3], 'y':[3, 4, 5]})
x.iloc[1] = {'x':9, 'y': 99}
x

   x   y
0  1   3
1  9  99
2  3   5

In [40]:
df = pd.DataFrame({'one' : [1., 2., 3.]})

In [41]:
df.two = [4, 5, 6]

<ipython-input-41-16f88a7ba01c>:1: UserWarning: Pandas doesn't allow columns to be created via a new attribute name - see https://pandas.pydata.org/pandas-docs/stable/indexing.html#attribute-access
  df.two = [4, 5, 6]

In [42]:
df

   one
0  1.0
1  2.0
2  3.0

### Slicing range

In [43]:
s[:5]

2000-01-01    0.364024
2000-01-02   -0.667282
2000-01-03   -0.150349
2000-01-04    0.201652
2000-01-05   -1.297984
Freq: D, Name: A, dtype: float64

In [45]:
s[::2] #2일씩 건너뛰어서

2000-01-01    0.364024
2000-01-03   -0.150349
2000-01-05   -1.297984
2000-01-07   -0.410140
Freq: 2D, Name: A, dtype: float64

In [46]:
s2 = s.copy()

In [47]:
s2[:5] = 0
s2

2000-01-01    0.000000
2000-01-02    0.000000
2000-01-03    0.000000
2000-01-04    0.000000
2000-01-05    0.000000
2000-01-06    1.549224
2000-01-07   -0.410140
2000-01-08    2.216367
Freq: D, Name: A, dtype: float64

In [50]:
df[:3]

                   A         B         C         D
2000-01-01  0.845624 -0.573511  0.981086  1.535190
2000-01-02  0.214991 -0.059478  1.467596  0.641940
2000-01-03 -0.982135  0.907686 -1.160281  0.601779

In [51]:
df[::-1]

                   A         B         C         D
2000-01-08  0.391406 -1.122850 -0.437759  0.199615
2000-01-07  0.320570  0.969433  0.597147  1.785227
2000-01-06 -0.511338 -0.478900  0.724252  1.374516
2000-01-05 -1.497248  0.023301  0.734020  0.757533
2000-01-04 -1.886670  0.398935  1.254168  0.012873
2000-01-03 -0.982135  0.907686 -1.160281  0.601779
2000-01-02  0.214991 -0.059478  1.467596  0.641940
2000-01-01  0.845624 -0.573511  0.981086  1.535190

### Selection by label

- .loc는 유형과 호환되지않는 Slicing에 대해서는 Error가 발생한다.

In [54]:
dfl = pd.DataFrame(np.random.randn(5, 4), columns=list("ABCD"), index=pd.date_range('20130101', periods=5))
dfl

                   A         B         C         D
2013-01-01 -0.297845 -1.859978  0.293554  0.499081
2013-01-02 -0.228546 -0.980753  0.138730  0.353746
2013-01-03  0.590677 -0.944220 -1.527204  0.666230
2013-01-04  1.649873  0.277757 -0.796181 -0.643190
2013-01-05  1.051610 -0.202264  0.831584  0.528123

In [56]:
dfl.loc[2:3]

TypeError: cannot do slice indexing on DatetimeIndex with these indexers [2] of type int

In [57]:
dfl.loc['20130102' : '20130104']

                   A         B         C         D
2013-01-02 -0.228546 -0.980753  0.138730  0.353746
2013-01-03  0.590677 -0.944220 -1.527204  0.666230
2013-01-04  1.649873  0.277757 -0.796181 -0.643190

다음과 같이 Slicing하여 사용가능하다.
- 단일 lable : df.loc[5], df.loc['a']
- lable 배열 : df.loc['a', 'b', 'c']
- lable Slice : df.loc['a' : 'f']
- boolean array : df.loc['a'] > 0

In [59]:
s1 = pd.Series(np.random.randn(6), index = list('abcdef'))
s1

a    0.250354
b   -0.301589
c   -0.805390
d    1.457062
e   -1.887684
f    0.883016
dtype: float64

In [60]:
s1.loc['c':]

c   -0.805390
d    1.457062
e   -1.887684
f    0.883016
dtype: float64

In [61]:
s1.loc['b']

-0.3015891982115386

In [62]:
# 값 setting에도 작동한다
s1.loc['c':] = 0
s1

a    0.250354
b   -0.301589
c    0.000000
d    0.000000
e    0.000000
f    0.000000
dtype: float64

In [63]:
df1 = pd.DataFrame(np.random.randn(6, 4), index = list('abcdef'), columns=list('ABCD'))
df1

          A         B         C         D
a -1.684216  0.174825 -0.675868  0.438727
b  0.778354 -0.022409 -1.838619 -0.011561
c  0.408219  0.605779 -0.973101  1.261623
d -1.372667 -0.771399 -0.483467  1.044828
e  0.243304  1.301395  0.106191  1.849830
f  1.176761  1.132178 -0.986831  1.447529

In [64]:
df1.loc['d' :, "A":"C"]

          A         B         C
d -1.372667 -0.771399 -0.483467
e  0.243304  1.301395  0.106191
f  1.176761  1.132178 -0.986831

In [66]:
df1.loc['a']

A   -1.684216
B    0.174825
C   -0.675868
D    0.438727
Name: a, dtype: float64

In [67]:
df1.loc['a'] > 0

A    False
B     True
C    False
D     True
Name: a, dtype: bool

In [68]:
df1.loc[:, df1.loc['a'] > 0]

          B         D
a  0.174825  0.438727
b -0.022409 -0.011561
c  0.605779  1.261623
d -0.771399  1.044828
e  1.301395  1.849830
f  1.132178  1.447529

In [69]:
mask = pd.array([True, False, True, False, pd.NA, False], dtype='boolean')
mask

<BooleanArray>
[True, False, True, False, <NA>, False]
Length: 6, dtype: boolean

In [70]:
df1[mask]

          A         B         C         D
a -1.684216  0.174825 -0.675868  0.438727
c  0.408219  0.605779 -0.973101  1.261623

In [71]:
# this is also equivalent to 'df1.at['a', 'A']'
df1.loc['a', 'A']

-1.6842160746349892

## Slicing with labels - .loc

In [72]:
s = pd.DataFrame(list('abcde'), index = [0, 3, 2, 5, 4])
s

   0
0  a
3  b
2  c
5  d
4  e

In [73]:
s.loc[3:5]

   0
3  b
2  c
5  d

In [74]:
s.sort_index()

   0
0  a
2  c
3  b
4  e
5  d

In [75]:
s.sort_index().loc[1:6]

   0
2  c
3  b
4  e
5  d

In [76]:
s = pd.Series(list('abcdef'), index = [0, 3, 2, 5, 4, 2])
s

0    a
3    b
2    c
5    d
4    e
2    f
dtype: object

In [77]:
s.loc[3:5]

3    b
2    c
5    d
dtype: object

## Selection by position - .iloc

 다음과 같이 엑세스 가능하다.
 - 정수 : df.iloc[5]
 - 배열 : df.iloc[4, 3, 2]
 - ints가 있는 슬라이싱 객체 : df.iloc[:5]
 - boolean 배열

In [78]:
s1 = pd.Series(np.random.randn(5), index = list(range(0, 10, 2)))
s1

0    1.746109
2    0.604197
4   -1.607315
6   -0.672217
8    0.850115
dtype: float64

In [79]:
s1.iloc[:3]

0    1.746109
2    0.604197
4   -1.607315
dtype: float64

In [80]:
s1.iloc[3]

-0.6722168762424806

In [81]:
s1.iloc[:3] = 3
s1

0    3.000000
2    3.000000
4    3.000000
6   -0.672217
8    0.850115
dtype: float64

In [82]:
df1 = pd.DataFrame(np.random.randn(6, 4), index=list(range(0, 12, 2)), columns=list(range(0, 8, 2)))
df1

           0         2         4         6
0  -0.302185 -0.520671 -0.061203 -1.742907
2  -0.830084 -1.301420 -0.047247  0.150474
4  -0.329054 -1.206860  1.433184  1.988052
6  -0.546717 -0.903641 -2.297636  0.186225
8  -0.923715 -1.994865  0.385366  1.270012
10 -1.005810  0.599280  0.138799 -0.944217

In [83]:
df1.iloc[:3]

          0         2         4         6
0 -0.302185 -0.520671 -0.061203 -1.742907
2 -0.830084 -1.301420 -0.047247  0.150474
4 -0.329054 -1.206860  1.433184  1.988052

In [84]:
df1.iloc[1:5, 2:4]

          4         6
2 -0.047247  0.150474
4  1.433184  1.988052
6 -2.297636  0.186225
8  0.385366  1.270012

In [85]:
df1.iloc[[1, 3, 5], [1, 3]]

           2         6
2  -1.301420  0.150474
6  -0.903641  0.186225
10  0.599280 -0.944217

In [86]:
df1.iloc[1:3, :]

          0        2         4         6
2 -0.830084 -1.30142 -0.047247  0.150474
4 -0.329054 -1.20686  1.433184  1.988052

In [88]:
df1.iloc[:, 1:3]

           2         4
0  -0.520671 -0.061203
2  -1.301420 -0.047247
4  -1.206860  1.433184
6  -0.903641 -2.297636
8  -1.994865  0.385366
10  0.599280  0.138799

In [89]:
# This is also equivalent to 'df1.iat[1,1]'
df1.iloc[1,1]

-1.301419538616248

In [92]:
x = list('abcdef')
x

['a', 'b', 'c', 'd', 'e', 'f']

In [93]:
x[4:10]

['e', 'f']

In [94]:
x[8:10]

[]

In [96]:
s = pd.Series(x)
s

0    a
1    b
2    c
3    d
4    e
5    f
dtype: object